### 2\. Краткая история

Верите или нет, но Node.js всего 10 лет. 

Для сравнения: JavaScript существует на протяжении 24 лет, а веб - 30\. 

10 лет - это небольшой срок для технологии, однако порой кажется, что Node.js существовал всегда. 

Я познакомился с Node.js, когда прошло всего 2 года с момента его появления, но уже тогда, несмотря на ограниченность информации, чувствовалось, что его ждет большое будущее. 

В этом разделе мы посмотрим на общую картину истории Node.js. 

##### Немного истории

JavaScript - это язык программирования, изобретенный в Netscape как скриптовый инструмент манипуляции веб-страницами в браузере [Netscape Navigator][anchor0]. 

Частью бизнес-модели Netscape являлась продажа веб-серверов, включающих среду Netscape LiveWire, способную создавать динамические страницы посредством серверного JavaScript. К сожалению, Netscape LiveWire провалился и серверный JavaScript не был популярен до появления Node.js. 

Одним из ключевых факторов популярности Node.js является время его появления. Несколькими годами ранее JavaScript был признан серьезным языком программирования благодаря Web 2.0-приложениям (таким как Flickr, Gmail и др.), показавших миру, как может выглядеть современный веб. 

Движки JavaScript также стали значительно лучше, поскольку браузеры стремились к повышению производительности во благо пользователей. Команды разработчиком главных браузеров упорно трудились над реализацией лучшей поддержки JavaScript и его максимально быстрого выполнения. Движок, который использует Node.js, V8 (также известный как Chrome V8 - открытый движок JavaScript проекта Chromium), вышел победителем из этого соревнования. 

Node.js появился в нужное время и в нужном месте. К счастью, это не единственная причина его популярности. Проект содержал большое количество инновационных идей и подходов к серверной JavaScript-разработке, которые пришлись по вкусу многим разработчикам. 

##### 2009

* Появился Node.js
* Появился [npm][anchor1]

##### 2010

* Express
* Socket.io

##### 2011

* npm версии 1.0
* Крупные компании начали внедрять Node.js: LinkedIn, Uber и др.
* hapi

##### 2012

* Продолжается быстрый рост популярности Node.js

##### 2013

* Первая крупная блог-платформа на Node.js: [Ghost][anchor2]
* Koa

##### 2014

* Большой раскол: из Node.js выделился io.js (форк - создание обособленной ветки в системе контроля версий Git) ради поддержки синтаксиса ES6 и более динамичного развития

##### 2015

* Основание [Node.js Foundation][anchor3]
* Io.js вернулся в Node.js (мерж - слияние веток в Git)
* В npm появились частные (приватные) модули
* Node.js версии 4 (версий 1, 2 и 3 не существовало)

##### 2016

* Инцидент с [left-pad][anchor4]
* [Yarn][anchor5]
* Node.js версии 6

##### 2017

* Повышение безопасности npm
* Node.js 8
* HTTP/2
* V8 включил Node.js в комплект тестирования, официально признав Node.js движком JavaScript в дополнение к Chrome
* 3 млрд скачиваний npm каждую неделю

##### 2018

* Node.js 10
* Экспериментальная поддержка [ES-модулей][anchor6] с расширением .mjs


[anchor0]: https://ru.wikipedia.org/wiki/Netscape_Navigator
[anchor1]: https://www.npmjs.com/
[anchor2]: https://ghost.org/
[anchor3]: https://openjsf.org/
[anchor4]: https://blog.npmjs.org/post/141577284765/kik-left-pad-and-npm
[anchor5]: https://classic.yarnpkg.com/en/
[anchor6]: https://nodejs.org/api/esm.html

