### 3\. Установка

Node.js может быть установлен разными способами. 

Дистрибутивы для основных платформ доступны на [официальном сайте][anchor0]. 

Очень удобным способом установки Node.js является использование пакетного менеджера. У каждой операционной системы он свой. 

На macOS таковым является [Homebrew][anchor1], позволяющий легко установить Node.js с помощью командной строки:
`
brew install node
`

Список пакетных менеджеров для Linux, Windows и др. систем находится [здесь][anchor2]. 

nvm - популярный способ запуска Node.js. Он позволяет легко переключаться между версиями Node.js, устанавливать новые версии для тестирования и отменять их установку в случае, если что-то пошло не так. 

Он также очень полезен при тестировании кода в старых версиях Node.js. 

Для более подробной информации о nvm перейдите по [этой ссылке][anchor3].

Мой совет - используйте официальный установщик, если только начинаете разрабатывать и ранее не пользовались Homebrew. 

После установки Node.js вы получаете доступ к исполняемой программе node в командной строке.

[anchor0]: https://nodejs.org/en/download/
[anchor1]: https://brew.sh/
[anchor2]: https://nodejs.org/en/download/package-manager/
[anchor3]: https://github.com/nvm-sh/nvm

