### 20\. Установка старой версии пакета

Вы можете устанавливать старые версии пакетов с помощью спецификатора @:
`
npm install <package-name>@<version>
`

Например: 
`
npm install cowsay
`

установит версию 1.3.1 (последнюю на момент написания этих строк). 

Установим версию 1.2.0:
`
npm install cowsay@1.2.0
`

Тоже самое можно делать с глобальными пакетами: 
`
npm install -g webpack@4.16.4
`

Для того, чтобы увидеть список предыдущих версий пакета, необходимо выполнить `npm view <package-name\> versions`:

    ❯ npm view cowsay versions

    [ '1.0.0',
      '1.0.1',
      '1.0.2',
      '1.0.3',
      '1.1.0',
      '1.1.1',
      '1.1.2',
      '1.1.3',
      '1.1.4',
      '1.1.5',
      '1.1.6',
      '1.1.7',
      '1.1.8',
      '1.1.9',
      '1.2.0',
      '1.2.1',
      '1.3.0',
      '1.3.1' ]

