### 47\. Модуль os

Данный модуль предоставляет множество функций для получения информации об операционной системе и компьютере, на котором запущена программа. 
`
const os = require('os')
`

Существует несколько полезных свойств, содержащий важную информацию о файлах:

* os.EOL - содержит последовательность разделителей строк. Таковыми являются \\\\n на Linux/macOS и \\\\r\\\\n на Windows
* os.constants.signals - содержит константы, связанные с обработкой сигналов процессов, таких как SIGHUP, SIGKILL и т.д.
* os.constants.errno - содержит константы для отчетов об ошибках, таких как EADDRINUSE, EOVERFLOW и др.

Рассмотрим основные методы модуля os. 

##### os.arch()

Возвращает строку, определяющую архитектуру процессора, например, arm, x64, arm64. 

##### os.cpus()

Возвращает иформацию о процессоре. 

Например:
`
[
    {
      model: 'Intel(R) Core(TM)2 Duo CPU     P8600  @ 2.40GHz',
      speed: 2400,
      times: {
        user: 281685380,
        nice: 0,
        sys: 187986530,
        idle: 685833750,
        irq: 0
      }
    },
    {
      model: 'Intel(R) Core(TM)2 Duo CPU     P8600  @ 2.40GHz',
      speed: 2400,
      times: {
        user: 282348700,
        nice: 0,
        sys: 161800480,
        idle: 703509470,
        irq: 0
      }
    }
  ]
`

##### os.endinanness()

Возвращает BE или LE в зависимости от порядка компиляции байтов (от старшего к младшему или от младшего к старшему). 

##### os.freemem()

Возвращает количество байтов свободной памяти. 

##### os.homedir()

Возвращает путь домашней директории текущего пользователя. 

Например:
`
'/Users/joe'
`

##### os.hostname()

Возвращает название хоста. 

##### os.loadavg()

Возвращает вычисленное операционной системой значение средней нагрузки. 

На Linux/macOS возвращаются только суественные значения. 

Например: 
`
[3.68798828125, 4.00244140625, 11.1181640625]
`

##### os.networkInterface()

Возвращает информацию об интерфейсе доступа к сети. 

Например: 
`
{ lo0:
        [ { address: '127.0.0.1',
            netmask: '255.0.0.0',
            family: 'IPv4',
            mac: 'fe:82:00:00:00:00',
            internal: true },
          { address: '::1',
            netmask: 'ffff:ffff:ffff:ffff:ffff:ffff:ffff:ffff',
            family: 'IPv6',
            mac: 'fe:82:00:00:00:00',
            scopeid: 0,
            internal: true },
          { address: 'fe80::1',
            netmask: 'ffff:ffff:ffff:ffff::',
            family: 'IPv6',
            mac: 'fe:82:00:00:00:00',
            scopeid: 1,
            internal: true } ],
       en1:
        [ { address: 'fe82::9b:8282:d7e6:496e',
            netmask: 'ffff:ffff:ffff:ffff::',
            family: 'IPv6',
            mac: '06:00:00:02:0e:00',
            scopeid: 5,
            internal: false },
          { address: '192.168.1.38',
            netmask: '255.255.255.0',
            family: 'IPv4',
            mac: '06:00:00:02:0e:00',
            internal: false } ],
       utun0:
        [ { address: 'fe80::2513:72bc:f405:61d0',
            netmask: 'ffff:ffff:ffff:ffff::',
            family: 'IPv6',
            mac: 'fe:80:00:20:00:00',
            scopeid: 8,
            internal: false } ] }
`

##### os.platform()

Возвращает платформу, для которой выполнялась компиляция: 

* darwin
* freebsd
* linux
* openbsd
* win32

##### os.release()

Возвращает версию (релиз) операционной системы. 

##### os.tmpdir()

Возвращает путь определенной временной директории. 

##### os.totalmem()

Возвращает количество байт доступной памяти. 

##### os.type()

Определяет операционную систему: 

* Linux
* Darwin на macOS
* Windows\_NT на Windows

##### os.uptime()

Возвращает количество секунд, прошедших с момента последней перезагрузки. 

##### os.userInfo()

Возвращает информацию о текущем пользователе.
